Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/faq.tmx
Source language: en
Languages: pl

source: :meth:`~str.join` is a string method because in using it you are telling the separator string to iterate over a sequence of strings and insert itself between adjacent elements. This method can be used with any argument which obeys the rules for sequence objects, including any new classes you might define yourself. Similar methods exist for bytes and bytearray objects.
pl: :meth:`~str.join` jest sposobem postępowania ciągów znaków ponieważ używając go mówisz ciągowi znaków separatora aby iterował ponad sekwencją ciągów znaków i wstawił się pomiędzy sąsiadujące elementy. Ta metoda może być użyta z dowolnymi argumentami co zgadza się z zasadami przedmiotów sekwencji, włączając w to jakiekolwiek nowe uogólnienia które sam możesz zdefiniować. Podobne metody istnieją dla kęsów i przedmiotów tablic-kęsów.

source: How fast are exceptions?
pl: Jak szybkie są wyjątki?

source: A try/except block is extremely efficient. Actually catching an exception is expensive. In versions of Python prior to 2.0 it was common to use this idiom::
pl: Blok try/except jest wyjątkowo efektywny. Samo złapanie wyjątku jest kosztowne. W wersjach języka pytonowskiego wcześniejszych od 2.0 częste było użycie tego idiomu::

source: This only made sense when you expected the dict to have the key almost all the time. If that wasn't the case, you coded it like this::
pl: To miało sens tylko wtedy gdy spodziewałeś się że słownik będzie miał klucze prawie zawsze. Jeśli tak nie było, kodowałeś to w następujący sposób::

source: For this specific case, you could also use ``value = dict.setdefault(key, getvalue(key))``, but only if the ``getvalue()`` call is cheap enough because it is evaluated in all cases.
pl: Dla tego szczególnego przypadku, mogłeś także użyć ``value=dict.setdefault(key,getvalue(key))``, ale tylko jeśli wywołanie ``getvalue()`` było wystarczająco tanie obliczeniowo ponieważ było obliczane we wszystkich przypadkach.

source: Why isn't there a switch or case statement in Python?
pl: Dlaczego nie ma wyrażenia switch lub case w języku pytonowskim?

source: You can do this easily enough with a sequence of ``if... elif... elif... else``. There have been some proposals for switch statement syntax, but there is no consensus (yet) on whether and how to do range tests. See :pep:`275` for complete details and the current status.
pl: Możesz tego dokonać wystarczająco łatwo za pomocą sekwencji ``if... elif... elif... else``. Były pewne propozycje na składnię instrukcji wyboru, ale nie ma konsensusu (jeszcze) o tym czy i jak wykonywać testy zakresu. Zob. :pep:`275` dla kompletnych szczegółów i obecnego statusu.
